app/views/api/videos/_video.json.jbuilder


json.creationDate video.created_at.strftime("%b %d, %Y")
---
INSERT INTO "videos" ("title", "uploader_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sadfasgasdg"], ["uploader_id", 4], ["created_at", "2020-08-20 19:15:50.097652"], ["updated_at", "2020-08-20 19:15:50.097652"], ["description", ""]]