app/controllers/api/videos_controller.rb

    def show
        @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @video = Video.new(video_params)

        if @video.save
---
INSERT INTO "videos" ("title", "uploader_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sadfasgasdg"], ["uploader_id", 4], ["created_at", "2020-08-20 19:15:50.097652"], ["updated_at", "2020-08-20 19:15:50.097652"], ["description", ""]]

    def update
        @video = Video.find(params[:id])

        if @video.update(video_params)
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "videos" SET "updated_at" = $1 WHERE "videos"."id" = $2  [["updated_at", "2020-08-20 22:57:36.226665"], ["id", 9]]

    def destroy
        @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]